Repository: OS-expected/document-and-compare
Catalog: docAndCom_sol/docAndCom/docAndCom/Resources/AppResources.*.resx
Languages: pl_pl

# aboutProudlyUses
source: docAndCom proudly uses: <br/> - Xamarin.Forms, <br/> - SQLite, <br/> - iTextSharp, <br/> - Iconify and Font Awesome icons, <br/> - Xam.Plugin.Media, <br/> - Xamarin.Plugin.Calendar, <br/> - FFImageLoading.
pl_pl: docAndCom wykorzystuje: <br/> - Xamarin.Forms, <br/> - SQLite, <br/> - iTextSharp, <br/> - ikony Iconify i Font Awesome, <br/> - Xam.Plugin.Media, <br/> - Xamarin.Plugin.Calendar, <br/> FFImageLoading.

# aboutShortDescText
source: docAndCom is handy, open software tool developed by trolit(<span style="color: #E59648;">github.com/trolit</span>) under MIT license for Android. In short, app is designed to let users document their subject under prepared tag(s). After gaining some data users can obtain results as pdf file(s) allowing to easily compare changes between them. Want to help with making it better or add another localization? Message me :)
pl_pl: docAndCom to przydatne narzędzie open source stworzone przez trolit(<span style="color: #E59648;">github.com/trolit</span>), na licencji MIT dla platformy Android. W skrócie, aplikacja została wykonana po to, aby dać możliwość dokumentowania zmian w postaci zdjęć przypisanych do etykiet. Po zebraniu danych, użytkownik może wygenerować plik(i) pdf którymi łatwo porównuje się efekty. Jeżeli chcesz pomóc uczynić tą aplikację lepszą lub dodać kolejną lokalizację napisz do mnie :)

# aboutText
source: About
pl_pl: O aplikacji

# areYouSureText
source: Are you sure?
pl_pl: Na pewno?

# builtWithText
source: Built with Xamarin.Forms for
pl_pl: Aplikacja wykonana w Xamarin.Forms na

# cameraNotAvailableText
source: Camera is not available :(
pl_pl: Kamera nie jest dostępna :(

# cancelText
source: Cancel
pl_pl: Anuluj

# createFileText
source: Generate file
pl_pl: Wygeneruj plik

# createNewText
source: Create new
pl_pl: Utwórz nowy

# createTagDesc
source: Specify name of the tag(from 3 to 35 characters, no special characters, - and _ chars are allowed)
pl_pl: Wprowadź nazwę etykiety(od 3 do 35 znaków bez znaków specjalnych. Znaki - oraz _ są dozwolone).

# createTagTitleText
source: Tag
pl_pl: Etykieta

# createText
source: Create
pl_pl: Utwórz

# deleteFileConfirmationText
source: Are you sure, you want to delete <%fileName%>?
pl_pl: Na pewno chcesz usunąć <%fileName%>?

# deleteFileFromStorageText
source: Remove also file from device storage?
pl_pl: Czy chcesz usunąć plik również z pamięci urządzenia?

# deleteThatTag
source: Do you want to delete that tag?
pl_pl: Czy chcesz usunąć tą etykietę?

# documentImageText
source: Document
pl_pl: Zapisz

# documentText
source: Document
pl_pl: Archiwum

# fileGeneratedText
source: Document generated. After prompt is closed you will be redirected to the list of files.
pl_pl: Plik został wygenerowany. Możesz wrócić do poprzedniej strony z listą plików.

# fileGenTag
source: Tag
pl_pl: Etykieta

# fileNotFoundOnDeviceText
source: File not found.
pl_pl: Plik nieodnaleziony.

# fileRefNotSavedButFileGenerated
source: Document reference not saved, generated file is available at: <%filePath%>
pl_pl: Powiązanie do pliku nie zostało zapisane, wygenerowany plik znajduje się: <%filePath%>

# fileRefNotSavedNotGenerated
source: Document reference not saved, file not generated.
pl_pl: Powiązdanie do pliku nie zostało zapisane, plik nie został wygenerowany.

# fileSchemeNotChosenText
source: File scheme type not chosen. File creation aborted.
pl_pl: Układ nie został wybrany. Generowanie pliku przerwane.

# filesText
source: Files
pl_pl: Pliki

# galleryText
source: Gallery
pl_pl: Galeria

# generateFilepickerList
source: List
pl_pl: Lista

# generateFilepickerTabular
source: Tabular
pl_pl: Tabela

# generateFilePt1Text
source: 1. Select tag to generate PDF.
pl_pl: 1. Wybierz etykiete na podstawie której ma być wygenerowany plik PDF

# generateFilePt2Text
source: *List consists only of tags that have at least 3 documented images.
pl_pl: *Lista składa się z etykiet, które mają przynajmniej 3 zdjęcia

# generateFilePt3Text
source: 2. Choose document output scheme.
pl_pl: 2. Wybierz układ pliku wyjściowego.

# generateText
source: Generate
pl_pl: Pliki

# generatingFileText
source: Generating file...
pl_pl: Generowanie pliku...

# getStartedText
source: Get Started
pl_pl: Pomoc

# greatText
source: Great!
pl_pl: Świetnie!

# hardDeleteAlertText
source: This operation will permanently remove documented image(of <%tagName%> tag) from storage device.
pl_pl: Ta operacja spowoduje trwałe usunięcie zdjęcia zapisanego pod etykietą <%tagName%> z urządzenia.

# hardDeleteText
source: Hard delete
pl_pl: Usuń zdjęcie

# helpDocBtnText
source: 2. Doc
pl_pl: Archiwum

# helpDocPt1
source: Document section in the meaning of the app are graphics saved with date of creation assigned by user.
pl_pl: Archiwum w kontekście aplikacji to zapisane zdjęcia z datą przypisaną przez użytkownika aplikacji.

# helpDocPt2
source: To add new document, click document button from the main menu page, then press the icon placed in the toolbar section.
pl_pl: Żeby dodać nowy plik do archiwum, przejdź do archiwum z pozycji menu głównego aplikacji a następnie kliknij ikonę, która znajduje się na pasku narzędzi, z prawej strony.

# helpDocPt3
source: You can pick image from gallery or take a new one using camera. Whatever option you pick, images will be stored as app "temporary" files that are not viewable. This means that when you for e.g. delete image picked from gallery through local storage, the "tmp" copy will still be available in the app. You can force the app to make public copy of images made with camera by changing option in settings section that can be reached via main menu. After adding document, get back to the calendar view using toolbar back arrow icon. Days on which user documented something are marked with dot. To clarify, there is no given limit of documented images on specific day.
pl_pl: Możesz wybrać zdjęcie z galerii lub zrobić nowe. Po dodaniu zdjęcia, wróć do widoku z kalendarzem za pomocą strzałki znajdującej się na pasku narzędzi. Dni w których użytkownik udokumentował coś są zaznaczone kropką. Nie ma limitu liczby udokumentowanych zdjęć danego dnia.

# helpDocPt4
source: If you want to see what was documented on marked day, choose that day and hide calendar by using arrow placed in the right bottom corner or simply slide to the bottom to see the attached elements.
pl_pl: Jeżeli chcesz obejrzeć co zostało udokumentowane w oznakowanym dniu, wybierz ten dzień a następnie schowaj kalendarz używając strzałki umieszczonej w prawym dolnym rogu. Możesz też po wyborze dnia przewinąć ekran palcem w górę.

# helpDocPt5
source: Each image contains preview, tag name and functional buttons. You can see that image through gallery app in full perspective or delete it from device storage. To see again full calendar view, click once again arrow but this time placed on the right top corner.
pl_pl: Każde zdjęcie zawiera podgląd, nazwę przypisanej etykiety oraz przyciski funkcyjne. Możesz obejrzeć zdjęcie w pełnym wymiarze za pomocą galerii lub je usunąć. Uwaga: zdjęcie będzie prywatne jeżeli zostanie wykonane przez przycisk(a nie wybrane z galerii). Jeżeli chcesz mieć publiczną, niezależną od aplikacji kopie, przejdź do sekcji ustawień z głównego menu i przełącz odpowiednią opcję. Żeby wrócić do widoku kalendarza, kliknij ponownie strzałkę, która tym razem znajduje się w prawym górnym rogu.

# helpDocTitle
source: Step 2 - documenting
pl_pl: Krok 2 - dokumentowanie

# helpGenBtnText
source: 3. Gen
pl_pl: Pliki

# helpGenPt1
source: The third process is file generation. After collecting some data under specific tag(at least 3 images), you can generate pdf file that allows to easily compare images between themselves.
pl_pl: Trzecim procesem jest generowanie plików. Po zebraniu odpowiedniej liczby danych pod daną etykietą(minimum 3 zdjęcia) możesz wygenerować plik pdf, który pozwala na łatwe porównanie zdjęć między sobą.

# helpGenPt2
source: In order to generate new file, click generate button from the main menu page, then press the button placed next to the documents title - Create new.
pl_pl: Żeby wygenerować nowy plik, przejdź do sekcji pliki z menu głównego aplikacji a następnie naciśnij przycisk umieszczony obok tytułu - Utwórz nowy(ang. Create New).

# helpGenPt3
source: On the new page you will be asked to specify the tag that you want to document as pdf file and type of the output. Type is the way how results are being shown. You can choose between List and Tabular. List example:
pl_pl: Na nowej stronie należy wybrać etykietę, której zdjęcia chce się wygenerować w zestawieniu pliku pdf i jaki ma być układ pliku wyjściowego. Układ to sposób w jaki pokazywane są wyniki. Dostępna jest opcja lista i tabela. Przykład listy:

# helpGenPt4
source: To view generated document, get back to the documents list and tap on the eye icon(you need external program like Google Pdf Viewer). If you would like to copy the doc to e.g. PC, find on local storage device dir called DocAndComPDFs. If you still don't see pdf files while browsing on PC your device(MTP mode), download pdf file and the result in Downloads directory will be visible to PC explorer. If you cut or move generated file in the documents list, you will see note like in the first document below.
pl_pl: Żeby obejrzeć wygenerowany dokument, wróć do listy plików i naciśnij ikonę przedstawiającą oko(potrzebujesz zewnętrznego programu do odczytania pliku pdf np. Google Pdf Viewer). Jeżeli chcesz np. skopiować plik na komputer żeby się nim podzielić, przechować czy zobaczyć na większym ekranie, wyszukaj w pamięci lokalnej urządzenia katalog nazwany DocAndComPDFs. Jeżeli wytniesz lub przeniesiesz ten plik, na liście plików zobaczysz komunikat o tym, że pliku nie znaleziono w ścieżce zapisanej przez aplikację.

# helpGenPt5
source: If you did it intentionally it is worth to remove stored reference in the application by using bin icon. And that's it! You know how to use docAndCom app. I hope that it will be useful to you :) and btw... There is no limits in generated files for the same tag too.
pl_pl: Jeżeli taki był Twój plan, warto usunąć powiązanie przechowywane przez aplikację naciskając na ikonę kosza obok nazwy nieznalezionego pliku. <br/> <br/> I to tyle! Wiesz jak używać apkę docAndCom. Mam nadzieję, że się przyda :) PS... W przypadku wygenerowanych plików dla tej samej etykiety także nie ma limitu.

# helpGenTitle
source: Step 3 - generating
pl_pl: Krok 3 - generowanie

# helpSubText
source: Press one of the steps below to read the details.
pl_pl: Naciśnij jeden z przycisków żeby dowiedzieć się więcej.

# helpTagBtnText
source: 1. Tag
pl_pl: Etykiety

# helpTagPt1
source: Tag can be explained as category under which you will be able to document results. Name of the tag should be clear to you. For e.g. tag could be named: {brand}_hairDye if you would like to document effects of using specific hair dye and share for e.g. it's effectiveness to others.
pl_pl: Etykieta to kategoria pod którą możesz dokumentować zdjęcia. Nazwa etykiety powinna być przede wszystkim jasna dla ciebie. Przykładowa etykieta mogłaby wyglądać tak: {marka}_farbaDoWłosów jeżeli chcesz udokumentować wyniki używania konkretnej farby do włosów i np. podzielić się później skutecznością z innymi.

# helpTagPt2
source: In order to add tag, move to the tag section by clicking appropriate button from the main menu. Then click the icon placed in the toolbar section and specify name of the tag.
pl_pl: Żeby dodać etykietę, przejdź do sekcji etykiety, wciskając odpowiedni przycisk z poziomu menu aplikacji. Następnie kliknij ikonę umieszczoną w pasku narzędzi, wprowadź nazwę etykiety i potwierdź dodanie.

# helpTagPt3
source: If you would like remove the tag, you can do this by tapping icon placed next to the tag name. If it contains documented images, you will see prompt asking whether you want to remove them too from your device storage or no.
pl_pl: Jeżeli chcesz usunąć istniejącą etykietę, możesz to zrobić naciskając na ikonę umieszczoną obok nazwy etykiety. Jeżeli etykieta zawiera jakieś zdjęcia, zobaczysz dodatkowe pytanie o tym czy chcesz je usunąć z pamięci urządzenia.

# helpTagTitle
source: Step 1 - tagging
pl_pl: Krok 1 - etykiety

# imageAlreadyAddedToThatTagText
source: This image has been already saved under chosen tag. Operation aborted.
pl_pl: To zdjęcie zostało już udokumentowane pod wybraną etykietą. Operacja przerwana.

# imageClearReferenceAlertText
source: This operation will remove reference to the documented image from <%tagName%> tag, in application. Image won't be deleted from storage device.
pl_pl: Ta operacja usunie powiązanie do udokumentowanego zdjęcia z etykiety <%tagName%>. Zdjęcie nie zostanie usunięte z pamięci urządzenia.

# imageLeftText
source: image left on device storage.
pl_pl: zdjęcie pozostawione w pamięci urządzenia.

# imageNotDocumentedText
source: Image not documented in the app, try again!
pl_pl: Zdjęcie nie zostało zapisane w aplikacji, spróbuj ponownie!

# imageReferenceClearedText
source: Reference to the image cleared.
pl_pl: Odwołanie do zdjęcia wyczyszczone.

# imageReferenceClearProblemText
source: Problem with clearing reference occured :(
pl_pl: Wystąpił problem z usunięciem powiązania :(

# imageRefNotFoundText
source: Operation aborted. Reference to the image not found.
pl_pl: Operacja przerwana. Brak odwołania do zdjęcia w bazie danych.

# imageRemovedText
source: image removed from device storage.
pl_pl: zdjęcie usunięte z pamięci urządzenia.

# imageSuccessfulyDocumentedText
source: Image successfuly documented in the app. You can now return to the calendar.
pl_pl: Zdjęcie zostało poprawnie zapisane. Możesz teraz wrócić do widoku z kalendarza.

# imageTagRefNotFoundText
source: Image tag reference not found. Operation aborted.
pl_pl: Tag z którym zdjęcie jest powiązane nie został odnaleziony. Operacja przerwana.

# languageSettingInfo
source: Note: Pickers data are not translated.
pl_pl: Uwaga: Dane wewnątrz wyborów nie są tłumaczone.

# languageText
source: Language
pl_pl: Język

# loadingText
source: Loading...
pl_pl: Wczytywanie...

# localizationCredits
source: Localization credits: <br/> - English, @trolit <br/> - Polish, @trolit
pl_pl: Tłumaczenie: <br/> - angielski, @trolit <br/> - polski, @trolit

# minAndroidText
source: *Minimum Android required: 5.0 (API l. 21)
pl_pl: *Minimalna wersja Androida: 5.0 (API p. 21)

# MoreThanFourImagesDeletedText
source: images deleted from device storage.
pl_pl: zdjęć zostało usuniętych z pamięci urządzenia.

# multipleImages
source: images.
pl_pl: zdjęcia.

# noFilesTextPt1
source: Currently there are no docs.
pl_pl: Aktualnie nie ma żadnych plików.

# noFilesTextPt2
source: Make the first one using
pl_pl: Stwórz pierwszy korzystając z

# noFilesTextPt3
source: button placed above.
pl_pl: przycisku powyżej.

# noTagText
source: It looks like you did not create tag required to perform document operation. Would you like to be redirected to the tags page?
pl_pl: Wygląda na to, że nie posiadasz żadnej etykiety potrzebnej do wykonania tej operacji. Chcesz przejść do strony z etykietami?

# notEnoughImages
source: You don't have tag with at least 3 images to perform this operation.
pl_pl: Nie masz etykiety z minimalną liczbą 3 zdjęć żeby wykonać tą operację.

# NoText
source: No
pl_pl: Nie

# OopsText
source: Oops..
pl_pl: Ups..

# openImageText
source: Open image
pl_pl: Pokaż zdjęcie

# operationSuccessfulText
source: Operation successful!
pl_pl: Operacja udana!

# pdfDataText
source: Documented:
pl_pl: Udokumentowane:

# pdfEmptyText
source: empty
pl_pl: brak dalszych zdjec

# pdfSubSubTitle
source: Documented data from:
pl_pl: Dane pochodza z:

# pdfSubTitle
source: File generated with iTextSharp solution
pl_pl: Plik wygenerowany z pomoca iTextSharp

# pdfTypeText
source: Type
pl_pl: Układ

# photoPickNotSupportedText
source: Picking a photo is not supported :(
pl_pl: Robienie zdjęcia nie jest wspierane :(

# photoPreviewText
source: Photo preview
pl_pl: Podgląd zdjęcia

# pluralVariety
source: them
pl_pl: je

# previewText
source: Preview
pl_pl: Podgląd

# publicCopyDescText
source: *If this option is set to true(green color), new document photos made with camera tool will have additional, public and independent copy saved in 'Others' gallery album, in docAndComparePhotos dir.
pl_pl: *Gdy ta opcja jest włączona(zielony kolor) to przy dokumentowaniu nowego zdjęcia do archiwum, zdjęcie wykonane za pomocą kamery zostanie skopiowane do albumu urządzenia w postaci publicznego, niezależnego pliku(katalog Pozostałe/docAndComparePhotos).

# publicCopySubTitleText
source: Save copy of image, taken from the camera to album
pl_pl: Kopia zdjęcia wykonanego aparatem

# publicCopyText
source: Public copy
pl_pl: Publiczna kopia

# questionText
source: Question
pl_pl: Pytanie

# referenceClearedText
source: Reference cleared,
pl_pl: Powiązanie usunięte,

# referenceNotClearedText
source: Reference not cleared,
pl_pl: Powiązanie nie zostało usunięte,

# repositoryText
source: Repository
pl_pl: Repozytorium

# selectTagText
source: Select tag
pl_pl: Wybierz etykietę

# settingsNumOfColsNote
source: *This option lets user change amount of columns per row in a Tabular scheme. Be advised that the more columns you use per row, the less wider photos are.
pl_pl: *Ta opcja pozwala na zmianę liczby kolumn na wiersz w układzie tabelkowym generowanego pliku pdf. Pamiętaj, że im więcej kolumn jest w pojedynczym wierszu tym zdjęcia są mniejsze, żeby wszystkie pomieścić w wierszu.

# settingsText
source: Settings
pl_pl: Ustawienia

# singleImage
source: 1 image.
pl_pl: 1 zdjęcie.

# singleImageDeletedText
source: image deleted from device storage.
pl_pl: zdjęcie zostało usunięte z pamięci urządzenia.

# singularVariety
source: it
pl_pl: je

# SuccessText
source: Success
pl_pl: Sukces

# tabularExampleText
source: Tabular example:
pl_pl: Przykład układu tabelkowego:

# tabulaSchemeNumOfColsText
source: Tabular scheme(columns)
pl_pl: Układ tabelkowy(kolumny)

# tagAdded
source: Tag added to the app.
pl_pl: Etykieta została dodana do aplikacji.

# tagDuplicate
source: Tag not created. Application already contains tag named:
pl_pl: Etykieta nie została utworzona. W aplikacji znajduje się już tag o treści:

# tagForbiddenChars
source: Tag not created. One or more forbidden characters found.
pl_pl: Etykieta nie została utworzona. Wprowadzona nazwa zawiera jeden lub więcej niedozwolonych znaków.

# tagNotChosenText
source: It seems that you did not choose tag. File creation aborted.
pl_pl: Etykieta nie została wybrana. Generowanie pliku przerwane.

# tagNotEnoughChars
source: Tag not added. Not enough characters.
pl_pl: Etykieta nie została dodana. Wprowadzono za mało znaków.

# tagNotExistsText
source: Tag does not exist in database.
pl_pl: Etykieta nie istnieje w bazie danych.

# tagNotSavedError
source: Tag not saved, something bad happened :(
pl_pl: Etykieta nie została zapisana. Coś się zepsuło :(

# tagNotSelectedText
source: Tag not selected.
pl_pl: Etykieta nie została wybrana.

# tagRemoveAlertDesc
source: <%tagName%> tag is used by <%alert_phrase1%>. Do you also want to remove <%alert_phrase2%> from storage device?
pl_pl: Etykieta <%tagName%> jest używana przez <%alert_phrase1%>. Czy chcesz usunąć <%alert_phrase2%> z pamięci urządzenia?

# tagsPagePt1
source: No tags to show :(
pl_pl: Brak etykiet do wyświetlenia :(

# tagsPagePt2
source: Tap &#xf02b; icon
pl_pl: Kliknij ikone &#xf02b;

# tagsPagePt3
source: from the toolbar
pl_pl: z paska narzędzi

# tagsPagePt4
source: to create first one
pl_pl: aby stworzyć pierwszą etykietę

# tagsText
source: Tags
pl_pl: Etykiety

# tagText
source: Tag
pl_pl: Etykiety

# takePhotoText
source: Take photo
pl_pl: Zrób zdjęcie

# targetedAndroidText
source: *Target Android version: 9.0 (API l. 28)
pl_pl: *Celowana wersja Androida: 9.0 (API p. 28)

# upToFourImagesDeletedText
source: images deleted from device storage.
pl_pl: zdjęcia zostały usunięte z pamięci urządzenia.

# warningText
source: Warning
pl_pl: Uwaga

# YesText
source: Yes
pl_pl: Tak
